{
  "header" : {
    "headerHome": "Home",
    "headerCatalog": "Catalog",
    "headerRailings": "Railings",
    "headerFrames": "Frames",
    "headerGates": "Gates & Fances",
    "headerAboutUs": "About Us",
    "headerContact": "Contact"
  },
  
    "home" : {
      "homeHeroTitle" : "Timalex-Metal",
      "heroContactUsBtn" : "Contact Us",
      "heroCatalogBtn" : "About Us",

      "homeHeroAboutTitle" : "Reliable metal structures for residential and industrial needs.",
      "homeHeroAboutSubtitle" : "We specialize in manufacturing and installing gates, balconies, all kind of railings, welded frames, and fully customized metal projects. With over 31+ years of experience, in-house production and precision craftsmanship — we deliver quality you can trust.",

      "homeHeroAdvantagesText1" : "We’ve been working in the field of metal structures for over 30+ years, delivering reliable and functional solutions for both residential and commercial projects. We specialize in gates, balconies, railings, frames, and fully customized structures based on client designs.",
      "homeHeroAdvantagesText2" : "Our team consists of experienced craftsmen, engineers, and installers who are true experts in their work. Every project is carried out with strict attention to quality, precision, and safety standards.",
      "homeHeroAdvantagesText3" : "We operate our own production facilities equipped with modern tools and proven technologies, allowing us to implement even the most complex technical solutions — on time and without compromise.",
      
      
      "homeHeroOfferTitleCard1" : "Metal products",

      "homeWorkSectionTitle": "How We Work",
      "homeHeroStep1Title": "Consultation & Project Estimate",
      "homeHeroStep1Subtitle": "We carefully study your needs, technical requirements, and design preferences to prepare a fully customized project proposal that fits your vision, budget, and timeline.",
      "homeHeroStep2Title": "Agreement Signing",
      "homeHeroStep2Subtitle": "We formalize every important detail through a clear and comprehensive agreement, ensuring mutual understanding, transparency, and a foundation for a smooth and trusted collaboration.",
      "homeHeroStep3Title": "Production & Installation",
      "homeHeroStep3Subtitle": "Our expert team manufactures each component using top-grade materials and cutting-edge technologies, followed by professional on-site installation with strict quality and safety compliance.",
      "homeHeroStep4Title": "Project Handover",
      "homeHeroStep4Subtitle": "After a final thorough inspection, we hand over the completed project, ensuring everything meets the agreed standards and leaving you completely satisfied with the final result.",

      "homeContactFormTitle" : "Get in Touch with Us",
      "homeContactFormSubtitle" : "Have questions or ready to start your project? We're here to help — reach out today.",
      "homeContactFormSummary" : "Find our contact details below or send us a quick message through the form. Our team will respond as soon as possible to assist you."
    },  

    "balconies" : {
      "balconiesTitle" : "Custom metal frames for balconies, terraces, and architectural solutions",
      "balconiesSubtitle" : "We manufacture durable metal frames for both new builds and renovation projects. Each frame is custom-made to meet your design, dimensional, and technical requirements.",
      "balconiesBodyAdvantagesTitle" : "Why choose our frames?",
      "balconiesBodyAdvantagesSubtitle" : "Because we don’t just deliver steel – we deliver reliability, aesthetics, and precision engineering. Our frames are based on years of experience and dozens of completed projects across Moldova, Romania, and the Bulgary. We use certified materials, focus on structural integrity, and consider the local climate in every solution.",
      "balconiesBodyAdvantagesListItem1" : "📌 Reinforced structures with modern design and long service life",
      "balconiesBodyAdvantagesListItem2" : "📌 Fast production and delivery times, European-level service, and up to 5 years warranty",
      "balconiesBodyAdvantagesListItem3" : "📌 Tailored approach – from design consultation to final assembly",
      "balconiesBodyAdvantagesSummary" : "With us, you receive more than just a metal frame — you get a safe, solid foundation for your architectural vision.",

      "balconiesInfoTitle" : "Custom-Made Metal Balconies",
      "balconiesInfoSubtitle" : "Our company specializes in manufacturing metal balconies for various types of properties — from private houses and cottages to multi-storey residential buildings and commercial developments. We collaborate with both developers and private clients, tailoring each design to specific architectural and technical requirements.",
      "balconiesInfoSubtitle1" : "All balcony systems are built with a focus on safety, durability, and aesthetics. We offer a full range of services — from design to installation — and can also produce balconies without installation, based on customer-provided blueprints or sketches.",
      "balconiesInfoSubtitle2" : "Thanks to our professional approach and years of experience, we deliver solutions that combine reliability, a modern appearance, and compliance with European quality standards."

    },
    "railings" : {
      "railingsTitle" : "Reliable safety systems for staircases, terraces, and public environments",
      "railingsSubtitle" : "Durable steel railings for residential and public use. Focus on safety, precision workmanship, and architectural compatibility in every project.",
      "railingsBodyAdvantagesTitle" : "Why our railings?",
      "railingsBodyAdvantagesSubtitle" : "Because we offer more than just barriers — we create safe and aesthetic solutions that complement the style of your property. Our railings have been installed in dozens of projects in Moldova, Romania, and the Bulgary. We use only high-quality materials and adapt to the architecture and needs of each project.",
      "railingsBodyAdvantagesListItem1" : "📌 Durable constructions made of steel, aluminum, and glass — for both residential and commercial use.",
      "railingsBodyAdvantagesListItem2" : "📌 Clean installation, modern design, and up to 5-year warranty.",
      "railingsBodyAdvantagesListItem3" : "📌 Individual approach: from measuring and design to final installation.",
      "railingsBodyAdvantagesSummary" : "With us, you don’t just get railings — you get a well-thought-out and refined part of your space.",


      "railingsInfoTitle": "Custom-Made Metal Railings",
      "railingsInfoSubtitle": "Our company designs and manufactures metal railings tailored for balconies, stairs, terraces, and fencing systems. Whether it's a private residence or a commercial facility, we deliver solutions that combine safety and elegance.",
      "railingsInfoSubtitle1": "All railing systems are created with strict attention to technical norms and visual harmony. We work with architects, developers, and individual clients to ensure that every railing matches the style and structure of the space.",
      "railingsInfoSubtitle2": "Our experience in the European market allows us to guarantee quality materials, professional installation, and a long-lasting result that complies with EU safety standards."
    
    },
    "gates" : {
      "gatesTitle" : "Engineered access control solutions — convenience, automation, protection",
      "gatesSubtitle" : "Design and installation of manual or automated gates for private and commercial facilities. Tailored functionality and strong structural integrity.",

      "gatesBodyAdvantagesTitle": "Why choose our gates?",
      "gatesBodyAdvantagesSubtitle": "Because our gates are more than just an entrance — they are the face of your home or business. We’ve completed dozens of projects in Moldova, Romania, and the Bulgary. We focus on safety, functionality, and appearance, using only trusted materials.",
      "gatesBodyAdvantagesListItem1": "📌 Durable steel and aluminum structures with a modern or classic design.",
      "gatesBodyAdvantagesListItem2": "📌 Automation, safety features, and installation in line with European standards.",
      "gatesBodyAdvantagesListItem3": "📌 Custom-made solutions — from concept to execution, tailored to your needs.",
      "gatesBodyAdvantagesSummary": "With our gates, you get not only protection but also a stylish and representative element for your property.",

      "gatesInfoTitle": "Custom-Made Gates for Any Property",
      "gatesInfoSubtitle": "We specialize in manufacturing and installing gates for residential homes, industrial areas, and commercial spaces. We offer solutions for both manual and automatic gates, meeting technical and aesthetic demands.",
      "gatesInfoSubtitle1": "Each project is tailored to its specific environment. We work with developers and private clients, ensuring the gate matches the architectural style and safety requirements.",
      "gatesInfoSubtitle2": "Thanks to our experience, we deliver gates that are reliable, visually appealing, and compliant with top EU quality standards."
    },

    
    "aboutUs" : {
      "aboutUsCompanyInfoTitle" : "About us",
      "aboutUsCompanyInfoText" : "Timalex-Metal is a company with experience and reliability in the field of metal structures. We have been operating in the market for over 30 years, specializing in the manufacture of balcony railings, gates, railings, and custom-made structures of any complexity.",

      "aboutUsCompanyInfoExperience" : "Our experience and approach",
      "aboutUsCompanyInfoExperienceText" : "Our specialists are professionals with many years of experience. Each project goes through several stages: measurements, design, manufacturing, and installation. We always take into account the individual requirements of the client and offer the best technical solutions.",

      "aboutUsCompanyInfoProduction" : "Our own production",
      "aboutUsCompanyInfoProductionText" : "Our production is equipped with everything necessary for metal processing with millimeter precision. Thanks to this, we can produce both standard designs and non-standard products according to customer drawings.",

      "whatWeDoTitle": "What We Do",
      "whatWeDoSubtitle": "We specialize in manufacturing a wide range of metal products: from classic gates and balconies to complex welded structures and frames for industrial and residential needs.",
      "wwdItemGates": "⚙️ Gates – from classic to automated systems",
      "wwdBalconies": "🏢 Balcony constructions – aesthetics + safety",
      "wwdRailings": "🛠️ Railings and fences – for interior and exterior use",
      "wwdFrames": "🧱 Welded frames – for warehouses, canopies, construction",
      "wwdCustom": "🔩 Custom projects – based on drawings or customer ideas",
      "aboutQualityNote": "Every structure is the result of coordinated work by craftsmen, engineers, and installation teams. Our goal is not just to build — but to deliver metal solutions that last for years."
    },

    "totalsBlock" : {
      "readyOrdersText" : "Completed orders",
      "readyProjectsText" : "Completed projects",
      "monthlyPowerText" : "Tons of monthly capacity",
      "marketYearsText" : "Years on the market"
    },

    "contact" : {
      "contactHeaderTitle" : "Get in Touch",
      "contactHeaderSubtitle" : "We are open to cooperation and ready to answer all your questions. Here you can find our contact information and leave a request for a callback. Our team will get back to you as soon as possible.",
      "contactBodyInfoTitle" : "Points of contact:",
      "contactBodyInfoFirm" : "Timalex-metal",
      "contactBodyInfoCity" : "Slovakia, Bratislava",
      "contactBodyInfoPhone" : "Phone",
      "contactBodyInfoEmail" : "Email",
      "contactBodySocialLinks" : "Social links",
      "contactBodyFormFN" : "First and Last name",
      "contactBodyFormFirm" : "Company name",
      "contactFormBtn" : "Send",
      "contactLoadingBtn" : "Sending your information...",
      "contactFooterText" : "We look forward to connecting with you and building a long-term partnership. Thank you for your interest in our company.",
      "formReceivedText" : "Thank you for your submission. We will process it as soon as possible. A duplicate submission is not required, as the form has already been successfully submitted from this device."
    },

    "footer" : {
      "footerTitle" : "Timalex-metal",
      "footerSubtitle" : "Manufacturing and installation of metal structures since 1993. We work on individual and standard projects.",
      "footerSubscribe" : "Subscribe to our news!",
      "footerAuthor" : "Designed and created by @dhrb",
      "footerCopyright" : "All right reserved"
    }
  }