
  {
    "header" : {
      "headerHome": "Hlavná",
      "headerCatalog": "Katalóg",
      "headerBalconies": "Balkóny",
      "headerRailings": "Zábradlia",
      "headerGates": "Brány",
      "headerAboutUs": "O nás",
      "headerContact": "Kontakt"
    },
    "home" : {
      "homeHeroTitle" : "Timalex-Kov",
      "heroContactUsBtn" : "Kontaktuj nás!",

      "homeHeroAboutTitle" : "Kovové konštrukcie na mieru pre domácnosti aj firmy.",
      "homeHeroAboutSubtitle" : "Zabezpečujeme výrobu a montáž brán, balkónov, zábradlí, oceľových rámov a individuálnych riešení podľa požiadaviek klienta. Viac ako 30 rokov skúseností, vlastná výroba, dodržané termíny a spoľahlivé výsledky.",

      "homeHeroAdvantagesText1" : "V oblasti kovových konštrukcií pôsobíme už viac ako 30 rokov a dodávame spoľahlivé a funkčné riešenia pre súkromné aj komerčné projekty. Špecializujeme sa na brány, balkóny, zábradlia, oceľové rámy a individuálne konštrukcie podľa požiadaviek zákazníka.",
      "homeHeroAdvantagesText2" : "Náš tím tvoria skúsení majstri, inžinieri a montážnici, ktorí dokonale ovládajú svoje remeslo. Každý projekt realizujeme s dôrazom na kvalitu, presnosť a bezpečnostné štandardy.",
      "homeHeroAdvantagesText3" : "Disponujeme vlastnou výrobou, moderným vybavením a overenými technológiami, ktoré nám umožňujú realizovať aj tie najnáročnejšie technické riešenia — načas a bez kompromisov.",

      "homeHeroOfferTitleCard1" : "Kovové výrobky",
      "homeHeroOfferTitleCard2" : "Kovové rámy",
      "homeHeroOfferTitleCard3" : "Stavebné rámy",
      "homeHeroOfferTitleCard4" : "Tím profesionálov",

      "homeHeroOfferSubtitleCard1" : "Od malých až po veľké riešenia",
      "homeHeroOfferSubtitleCard2" : "Jednotlivé zákazky akejkoľvek zložitosti pre budovy a stavby",
      "homeHeroOfferSubtitleCard3" : "Rozpočtové riešenie problému výroby modulárnych priestorov.",
      "homeHeroOfferSubtitleCard4" : "S potrebnými zručnosťami ľahko vykonávame pridelené úlohy."
    },

    "catalog" : {
      "catalogHeaderTitle" : "Katalóg kovových výrobkov",
      "catalogHeaderSubtitle" : "V tejto časti nájdete príklady našich realizovaných projektov - balkónov, brán, zábradlí a iných kovových konštrukcií.",
      "catalogHeaderSubtitle2" : " Každý výrobok je vyrobený podľa individuálnych potrieb zákazníka a moderných štandardov kvality.",
      "allFilterBtn" : "Všetky",
      "balconsFilterBtn" : "Balkóny",
      "constructionsFilterBtn" : "Konštrukcie",
      "gatesFilterBtn" : "Brány"
    },

    "balconies" : {
      "balconiesTitle" : "Kovové konštrukcie na mieru pre náročné fasádne riešenia a architektúru",
      "balconiesSubtitle" : "Vyrábame kovové balkóny pre novostavby aj rekonštrukcie. Individuálny dizajn, statická spoľahlivosť a kvalitné spracovanie detailov."
    },
    "railings" : {
      "railingsTitle" : "Spoľahlivé bezpečnostné systémy pre schodiská, terasy a verejné priestory",
      "railingsSubtitle" : "Oceľové zábradlia pre domy aj verejné priestory. Dôraz na bezpečnosť, estetiku a precízne prispôsobenie architektúre."
    },
    "gates" : {
      "gatesTitle" : "Technické riešenia pre riadenie vstupu — komfort, automatizácia, bezpečnosť",
      "gatesSubtitle" : "Realizujeme manuálne aj automatické brány pre súkromné a firemné objekty. Kompletná montáž a technické prispôsobenie."
    },

    "aboutUs" : {
      "aboutUsCompanyInfoTitle" : "O nás",
      "aboutUsCompanyInfoText" : "Spoločnosť Timalex-Metal je symbolom spoľahlivosti a dlhoročných skúseností v oblasti kovových konštrukcií. Už viac ako 30 rokov sa venujeme výrobe balkónových zábradlí, brán, madiel a individuálnych konštrukcií na mieru.",

      "aboutUsCompanyInfoExperience" : "Naše skúsenosti a prístup",
      "aboutUsCompanyInfoExperienceText" : "Náš tím tvorí skupina odborníkov s bohatou praxou. Každý projekt prechádza viacerými fázami: meranie, návrh, výroba a montáž. Ku každému klientovi pristupujeme individuálne a hľadáme optimálne technické riešenia.",

      "aboutUsCompanyInfoProduction" : "Vlastná výroba",
      "aboutUsCompanyInfoProductionText" : "Disponujeme moderným vybavením, ktoré umožňuje presné spracovanie kovu. Vyrábame typizované aj atypické konštrukcie podľa výkresov alebo požiadaviek zákazníka.",
    

      "whatWeDoTitle": "Čo robíme",
      "whatWeDoSubtitle": "Špecializujeme sa na výrobu širokej škály kovových produktov: od klasických brán a balkónov až po zložité zvárané konštrukcie a rámy pre priemyselné a obytné objekty.",
      "wwdItemGates": "⚙️ Brány – od klasických po automatizované systémy",
      "wwdBalconies": "🏢 Balkónové konštrukcie – estetika + bezpečnosť",
      "wwdRailings": "🛠️ Zábradlia a ploty – pre interiér aj exteriér",
      "wwdFrames": "🧱 Zvárané rámy – pre sklady, prístrešky, stavby",
      "wwdCustom": "🔩 Individuálne projekty – podľa výkresov alebo predstáv klienta",
      "aboutQualityNote": "Každá konštrukcia je výsledkom koordinovanej práce majstrov, technológov a montážneho tímu. Naším cieľom nie je len 'niečo vyrobiť', ale dodať kovové riešenie, ktoré vydrží roky."
    
    },
    "totalsBlock" : {
      "readyOrdersText" : "Dokončených zákaziek",
      "readyProjectsText" : "Dokončených projektov",
      "monthlyPowerText" : "Ton mesačnej kapacity",
      "marketYearsText" : "Rokov na trhu"
    },

    "footer" : {
      "footerTitle" : "Timalex - kov",
      "footerSubtitle" : "Výroba a montáž kovových konštrukcií od roku 1993. Pracujeme na individuálnych a štandardných projektoch.",
      "footerSubscribe" : "Prihláste sa na odber našich noviniek!",
      "footerAuthor" : "Navrhol a vytvoril @dhrb",
      "footerCopyright" : "Všetky práva vyhradené"
    }
  }